{"format": "layers-model", "generatedBy": "keras v2.2.5", "convertedBy": "TensorFlow.js Converter v1.3.2", "modelTopology": {"keras_version": "2.2.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "ColorNet", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "block1_conv1R", "class_name": "Conv2D", "config": {"name": "block1_conv1R", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv1G", "class_name": "Conv2D", "config": {"name": "block1_conv1G", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv1B", "class_name": "Conv2D", "config": {"name": "block1_conv1B", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2R", "class_name": "Conv2D", "config": {"name": "block1_conv2R", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1R", 0, 0, {}]]]}, {"name": "block1_conv2G", "class_name": "Conv2D", "config": {"name": "block1_conv2G", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1G", 0, 0, {}]]]}, {"name": "block1_conv2B", "class_name": "Conv2D", "config": {"name": "block1_conv2B", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1B", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1_conv2R", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1_conv2G", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block1_conv2B", 0, 0, {}]]]}, {"name": "block2_conv1R", "class_name": "Conv2D", "config": {"name": "block2_conv1R", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "block2_conv1G", "class_name": "Conv2D", "config": {"name": "block2_conv1G", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "block2_conv1B", "class_name": "Conv2D", "config": {"name": "block2_conv1B", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "block2_conv2R", "class_name": "Conv2D", "config": {"name": "block2_conv2R", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1R", 0, 0, {}]]]}, {"name": "block2_conv2G", "class_name": "Conv2D", "config": {"name": "block2_conv2G", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1G", 0, 0, {}]]]}, {"name": "block2_conv2B", "class_name": "Conv2D", "config": {"name": "block2_conv2B", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1B", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2_conv2R", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2_conv2G", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block2_conv2B", 0, 0, {}]]]}, {"name": "block3_conv1R", "class_name": "Conv2D", "config": {"name": "block3_conv1R", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "block3_conv1G", "class_name": "Conv2D", "config": {"name": "block3_conv1G", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "block3_conv1B", "class_name": "Conv2D", "config": {"name": "block3_conv1B", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "block3_conv2R", "class_name": "Conv2D", "config": {"name": "block3_conv2R", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1R", 0, 0, {}]]]}, {"name": "block3_conv2G", "class_name": "Conv2D", "config": {"name": "block3_conv2G", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1G", 0, 0, {}]]]}, {"name": "block3_conv2B", "class_name": "Conv2D", "config": {"name": "block3_conv2B", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1B", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3_conv2R", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3_conv2G", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block3_conv2B", 0, 0, {}]]]}, {"name": "block4_conv1R", "class_name": "Conv2D", "config": {"name": "block4_conv1R", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "block4_conv1G", "class_name": "Conv2D", "config": {"name": "block4_conv1G", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "block4_conv1B", "class_name": "Conv2D", "config": {"name": "block4_conv1B", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block4_conv1R", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block4_conv1G", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["block4_conv1B", 0, 0, {}]]]}, {"name": "block5_conv1R", "class_name": "Conv2D", "config": {"name": "block5_conv1R", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "block5_conv1G", "class_name": "Conv2D", "config": {"name": "block5_conv1G", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "block5_conv1B", "class_name": "Conv2D", "config": {"name": "block5_conv1B", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block5_conv1R", 0, 0, {}], ["block3_conv2R", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block5_conv1G", 0, 0, {}], ["block3_conv2G", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["block5_conv1B", 0, 0, {}], ["block3_conv2B", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "block6_conv1R", "class_name": "Conv2D", "config": {"name": "block6_conv1R", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "block6_conv1G", "class_name": "Conv2D", "config": {"name": "block6_conv1G", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "block6_conv1B", "class_name": "Conv2D", "config": {"name": "block6_conv1B", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block6_conv1R", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block6_conv1G", 0, 0, {}]]]}, {"name": "up_sampling2d_5", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_5", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block6_conv1B", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}], ["block2_conv2R", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}], ["block2_conv2G", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}], ["block2_conv2B", 0, 0, {}]]]}, {"name": "block7_conv1R", "class_name": "Conv2D", "config": {"name": "block7_conv1R", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "block7_conv1G", "class_name": "Conv2D", "config": {"name": "block7_conv1G", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "block7_conv1B", "class_name": "Conv2D", "config": {"name": "block7_conv1B", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block7_conv1R", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block7_conv1G", 0, 0, {}]]]}, {"name": "up_sampling2d_6", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_6", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block7_conv1B", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}], ["block1_conv2R", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}], ["block1_conv2G", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}], ["block1_conv2B", 0, 0, {}]]]}, {"name": "block8_conv1R", "class_name": "Conv2D", "config": {"name": "block8_conv1R", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "block8_conv1G", "class_name": "Conv2D", "config": {"name": "block8_conv1G", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "block8_conv1B", "class_name": "Conv2D", "config": {"name": "block8_conv1B", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "block9_conv1R", "class_name": "Conv2D", "config": {"name": "block9_conv1R", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block8_conv1R", 0, 0, {}]]]}, {"name": "block9_conv1G", "class_name": "Conv2D", "config": {"name": "block9_conv1G", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block8_conv1G", 0, 0, {}]]]}, {"name": "block9_conv1B", "class_name": "Conv2D", "config": {"name": "block9_conv1B", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block8_conv1B", 0, 0, {}]]]}, {"name": "R_out", "class_name": "UpSampling2D", "config": {"name": "R_out", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block9_conv1R", 0, 0, {}]]]}, {"name": "G_out", "class_name": "UpSampling2D", "config": {"name": "G_out", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block9_conv1G", 0, 0, {}]]]}, {"name": "B_out", "class_name": "UpSampling2D", "config": {"name": "B_out", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["block9_conv1B", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["R_out", 0, 0], ["G_out", 0, 0], ["B_out", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": {"R_out": "mse", "G_out": "mse", "B_out": "mse"}, "metrics": ["mean_absolute_error"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": {"R_out": 1, "G_out": 1, "B_out": 1}}}, "weightsManifest": [{"paths": ["group1-shard1of12.bin", "group1-shard2of12.bin", "group1-shard3of12.bin", "group1-shard4of12.bin", "group1-shard5of12.bin", "group1-shard6of12.bin", "group1-shard7of12.bin", "group1-shard8of12.bin", "group1-shard9of12.bin", "group1-shard10of12.bin", "group1-shard11of12.bin", "group1-shard12of12.bin"], "weights": [{"name": "batch_normalization_1_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_10_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_11_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_12_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_14_1/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_14_1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_14_1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_15_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_15_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_2_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_3_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_4_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4_1/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4_1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_4_1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_5_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_7_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7_1/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8_1/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8_1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_8_1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9_1/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9_1/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9_1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_9_1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "block1_conv1B_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "block1_conv1B_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv1G_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "block1_conv1G_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv1R_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "block1_conv1R_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2B_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2B_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2G_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2G_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2R_1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2R_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1B_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1B_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv1G_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1G_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv1R_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1R_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2B_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2B_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2G_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2G_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2R_1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2R_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1B_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1B_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv1G_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1G_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv1R_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1R_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2B_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2B_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2G_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2G_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2R_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2R_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1B_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1B_1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv1G_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1G_1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv1R_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1R_1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1B_1/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "block5_conv1B_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block5_conv1G_1/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "block5_conv1G_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block5_conv1R_1/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "block5_conv1R_1/bias", "shape": [256], "dtype": "float32"}, {"name": "block6_conv1B_1/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "block6_conv1B_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block6_conv1G_1/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "block6_conv1G_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block6_conv1R_1/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "block6_conv1R_1/bias", "shape": [128], "dtype": "float32"}, {"name": "block7_conv1B_1/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "block7_conv1B_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block7_conv1G_1/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "block7_conv1G_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block7_conv1R_1/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "block7_conv1R_1/bias", "shape": [64], "dtype": "float32"}, {"name": "block8_conv1B_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "block8_conv1B_1/bias", "shape": [32], "dtype": "float32"}, {"name": "block8_conv1G_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "block8_conv1G_1/bias", "shape": [32], "dtype": "float32"}, {"name": "block8_conv1R_1/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "block8_conv1R_1/bias", "shape": [32], "dtype": "float32"}, {"name": "block9_conv1B_1/kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "block9_conv1B_1/bias", "shape": [1], "dtype": "float32"}, {"name": "block9_conv1G_1/kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": 